{
  "itensColetasDados": [
    {
      "texto": "Vamos começar escolhendo um formato para coletar os dados. Existem algumas opções disponíveis, como arquivos .xlsx, .csv e .json. Cada um desses formatos possui características específicas, então é importante entender as diferenças para decidir qual se adapta melhor ao seu objetivo.",
      "itens": [
        "O .xlsx é o formato padrão de planilhas do Excel, ideal quando os dados estão organizados em tabelas e podem conter múltiplas abas.",
        "O .csv é uma versão mais simples, onde os dados são separados por vírgulas — excelente para quando você precisa de um arquivo leve e fácil de processar.",
        "Já o .json é um formato muito usado em aplicações web e APIs, ideal para dados mais estruturados ou hierárquicos."
      ]
    }
  ],
  "itensTreino": [
    {
      "texto": "Depois de carregar os dados, o próximo passo é selecionar quais atributos (ou colunas) vamos utilizar no nosso modelo. Esses atributos são as informações que ajudarão o algoritmo a identificar padrões e aprender com os dados.",
      "itens": []
    },
    {
      "texto": "Agora, é importante decidir se vamos ou não definir uma variável alvo, também chamada de target:",
      "itens": [
        "Se não escolhermos um target, estamos lidando com um problema de aprendizado não supervisionado. Isso significa que o modelo tentará encontrar padrões ou grupos nos dados sem saber a resposta certa. Um exemplo clássico é a clusterização.",
        "Se escolhermos um target, entramos no campo do aprendizado supervisionado, onde o modelo aprende com base em entradas e saídas já conhecidas."
      ]
    },
    {
      "texto": "Aqui entra uma distinção importante:",
      "itens": [
        "Se o target for uma string (texto ou categoria), estamos tratando de um problema de classificação. O modelo aprenderá a identificar a qual categoria um novo dado pertence.",
        "Se o target for numérico, estamos diante de um problema de regressão, onde o modelo tentará prever um valor contínuo, como o preço de um produto ou a temperatura de um dia."
      ]
    },
    {
      "texto": "Portanto, pense com atenção: você quer ensinar o modelo a prever algo (supervisionado) ou deixá-lo explorar os dados por conta própria (não supervisionado)? E, se for supervisionado, qual é o tipo de informação que ele deve prever.",
      "itens": []
    }
  ],
  "modelo": [
    {
      "texto": "Modelo com target do tipo texto (string): aprendizado supervisionado - classificação.",
      "itens": [
        "O modelo aprende a prever rótulos ou classes com base nos dados de entrada."
      ]
    },
    {
      "texto": "Modelo com target do tipo numérico: aprendizado supervisionado - regressão.",
      "itens": [
        "O modelo aprende a prever valores contínuos com base nos atributos fornecidos."
      ]
    },
    {
      "texto": "Modelo sem target: aprendizado não supervisionado - exemplo: clusterização.",
      "itens": [
        "Não há uma resposta certa a ser aprendida; o modelo busca estruturas ou padrões nos dados."
      ]
    }
  ],
  "resumos": {
    "target": [
      "Sem target: Aprendizado não supervisionado",
      "Com target do tipo texto: Aprendizado supervisionado - classificação",
      "Com target do tipo numérico: Aprendizado supervisionado - Regressão"
    ],
    "treinamento": [
      "Treino: usado para o modelo aprender, ex: 70%",
      "Teste: usado para avaliar se o modelo funciona bem com novos dados, ex: 30%",
      "Importância: uma boa divisão evita que o modelo decore os dados e garante que ele generalize bem"
    ],
    "modelo-classificacao": [
      "Aprendizado supervisionado: o modelo aprende com base em exemplos com entrada e saída conhecidas.",
      "Target do tipo texto (categorias, rótulos): como 'sim/não', 'alto/médio/baixo', 'cliente fiel', etc.",
      "Objetivo: classificar novas entradas em categorias."
    ],
    "modelo-regressao": [
      "Aprendizado supervisionado com saída contínua.",
      "Target numérico: como preço, idade, temperatura, nota de prova.",
      "Objetivo: prever valores contínuos com base nos atributos."
    ],
    "modelo-exploratorio": [
      "Aprendizado não supervisionado: o modelo busca padrões sem saber a resposta certa.",
      "Sem target definido.",
      "Objetivo: identificar estruturas nos dados, como em agrupamentos ou segmentações."
    ],
    "xlsx": [
      "O formato .xlsx é o padrão do Excel, adequado para dados em tabelas com múltiplas abas. Ao trabalhar com esses dados, é importante decidir se haverá uma variável alvo (target):"
    ]
  }
}